import { nanoid } from 'nanoid';

export const newsItems = [
  {
    id: nanoid(),
    date: '12 грудня 2021',
    url: 'news/news_1.jpg',
    title: 'Вітаємо наших однодумців!',
    description:
      'Коли корови перебувають в умовах любові, вони реалізують свою природну ункцію',
    text: 'Підопічні в захваті, особливо Ярила. Навіть маленькі досягнення це якісна мотивація, проте, як і раніше, головним елементом, що гальмує процес, стає критична ситуація з фінансами. Збір гостро необхідних коштів практично не рухається Якщо не виправиться ситуація, що склалася на сьогодні, притулок зануриться в непіднімні борги. Потрібно зрозуміти, що суми, якої бракує зараз, у минулих сезонах збиралися значно легше. Сьогодні ж через значне перенаправлення великих потоків пожертвувань у військовий сектор, інші благодійні напрямки ризикують бути просто знищені через відсутність коштів для життя.В особливо складному становищі перебувають притулки з такими великими істотами, як корови та коні. Військовий сектор, крім приватних пожертвувань, отримує величезну допомогу від інших країн, навіть притулки котикiв і собак отримують значну підтримку, якщо порівнювати їх із притулками істот, що належать до сільськогосподарського сектору, але при цьому не є комерційними підприємствами.'
  },
  {
    id: nanoid(),
    date: '12 feb 2022',
    url: 'news/news_2.jpg',
    title: 'Провели генеральне чищення загонів!',
    description:
      'Коли корови перебувають в умовах любові, вони реалізують свою природну функцію',
    text: 'Підопічні в захваті, особливо Ярила. Навіть маленькі досягнення це якісна мотивація, проте, як і раніше, головним елементом, що гальмує процес, стає критична ситуація з фінансами. Збір гостро необхідних коштів практично не рухається Якщо не виправиться ситуація, що склалася на сьогодні, притулок зануриться в непіднімні борги. Потрібно зрозуміти, що суми, якої бракує зараз, у минулих сезонах збиралися значно легше. Сьогодні ж через значне перенаправлення великих потоків пожертвувань у військовий сектор, інші благодійні напрямки ризикують бути просто знищені через відсутність коштів для життя.В особливо складному становищі перебувають притулки з такими великими істотами, як корови та коні. Військовий сектор, крім приватних пожертвувань, отримує величезну допомогу від інших країн, навіть притулки котикiв і собак отримують значну підтримку, якщо порівнювати їх із притулками істот, що належать до сільськогосподарського сектору, але при цьому не є комерційними підприємствами.'
  },
  {
    id: nanoid(),
    date: '12 feb 2023',
    url: 'news/news_3.jpg',
    title: 'Благодійна грошова допомога від UAnimals',
    description:
      'Коли корови перебувають в умовах любові, вони реалізують свою природну функцію',
    text: 'Підопічні в захваті, особливо Ярила. Навіть маленькі досягнення це якісна мотивація, проте, як і раніше, головним елементом, що гальмує процес, стає критична ситуація з фінансами. Збір гостро необхідних коштів практично не рухається Якщо не виправиться ситуація, що склалася на сьогодні, притулок зануриться в непіднімні борги. Потрібно зрозуміти, що суми, якої бракує зараз, у минулих сезонах збиралися значно легше. Сьогодні ж через значне перенаправлення великих потоків пожертвувань у військовий сектор, інші благодійні напрямки ризикують бути просто знищені через відсутність коштів для життя.В особливо складному становищі перебувають притулки з такими великими істотами, як корови та коні. Військовий сектор, крім приватних пожертвувань, отримує величезну допомогу від інших країн, навіть притулки котикiв і собак отримують значну підтримку, якщо порівнювати їх із притулками істот, що належать до сільськогосподарського сектору, але при цьому не є комерційними підприємствами.'
  },
  {
    id: nanoid(),
    date: '12 feb 2024',
    url: 'news/news_4.jpg',
    title: 'Вдалося виростити вітамінні смаколики!',
    description:
      'Коли корови перебувають в умовах любові, вони реалізують свою природну функцію',
    text: 'Підопічні в захваті, особливо Ярила. Навіть маленькі досягнення це якісна мотивація, проте, як і раніше, головним елементом, що гальмує процес, стає критична ситуація з фінансами. Збір гостро необхідних коштів практично не рухається Якщо не виправиться ситуація, що склалася на сьогодні, притулок зануриться в непіднімні борги. Потрібно зрозуміти, що суми, якої бракує зараз, у минулих сезонах збиралися значно легше. Сьогодні ж через значне перенаправлення великих потоків пожертвувань у військовий сектор, інші благодійні напрямки ризикують бути просто знищені через відсутність коштів для життя.В особливо складному становищі перебувають притулки з такими великими істотами, як корови та коні. Військовий сектор, крім приватних пожертвувань, отримує величезну допомогу від інших країн, навіть притулки котикiв і собак отримують значну підтримку, якщо порівнювати їх із притулками істот, що належать до сільськогосподарського сектору, але при цьому не є комерційними підприємствами.'
  },
  {
    id: nanoid(),
    date: '12 feb 2025',
    url: 'news/news_5.jpg',
    title: 'Зробили першу закупівлю кормів',
    description:
      'Коли корови перебувають в умовах любові, вони реалізують свою природну функцію',
    text: 'Підопічні в захваті, особливо Ярила. Навіть маленькі досягнення це якісна мотивація, проте, як і раніше, головним елементом, що гальмує процес, стає критична ситуація з фінансами. Збір гостро необхідних коштів практично не рухається Якщо не виправиться ситуація, що склалася на сьогодні, притулок зануриться в непіднімні борги. Потрібно зрозуміти, що суми, якої бракує зараз, у минулих сезонах збиралися значно легше. Сьогодні ж через значне перенаправлення великих потоків пожертвувань у військовий сектор, інші благодійні напрямки ризикують бути просто знищені через відсутність коштів для життя.В особливо складному становищі перебувають притулки з такими великими істотами, як корови та коні. Військовий сектор, крім приватних пожертвувань, отримує величезну допомогу від інших країн, навіть притулки котикiв і собак отримують значну підтримку, якщо порівнювати їх із притулками істот, що належать до сільськогосподарського сектору, але при цьому не є комерційними підприємствами.'
  }
];
