import { nanoid } from 'nanoid';

export const newsItems = [
  {
    id: nanoid(),
    url: 'news/news_1.jpg',
    title: 'Вітаємо наших однодумців!',
    description:
      'Коли корови перебувають в умовах любові, вони реалізують свою природну функцію'
  },
  {
    id: nanoid(),
    url: 'news/news_2.jpg',
    title: 'Провели генеральне чищення загонів!',
    description:
      'Коли корови перебувають в умовах любові, вони реалізують свою природну функцію'
  },
  {
    id: nanoid(),
    url: 'news/news_3.jpg',
    title: 'Благодійна грошова допомога від UAnimals',
    description:
      'Коли корови перебувають в умовах любові, вони реалізують свою природну функцію'
  },
  {
    id: nanoid(),
    url: 'news/news_4.jpg',
    title: 'Вдалося виростити вітамінні смаколики!',
    description:
      'Коли корови перебувають в умовах любові, вони реалізують свою природну функцію'
  },
  {
    id: nanoid(),
    url: 'news/news_5.jpg',
    title: 'Зробили першу закупівлю кормів',
    description:
      'Коли корови перебувають в умовах любові, вони реалізують свою природну функцію'
  }
];
