import { nanoid } from 'nanoid';

export const reviews = [
  {
    id: nanoid(),
    name: 'Анна',
    review:
      'Дуже сподобалась екскурсія, відвідували разом з дітьми, дуже захоплююче'
  },
  {
    id: nanoid(),
    name: 'Денис',
    review:
      'Дуже сподобалась екскурсія, відвідували разом з дітьми, дуже захоплююче'
  },
  {
    id: nanoid(),
    name: 'Олена',
    review:
      'Дуже сподобалась екскурсія, відвідували разом з дітьми, дуже захоплююче'
  },
  {
    id: nanoid(),
    name: 'Віталій',
    review:
      'Дуже сподобалась екскурсія, відвідували разом з дітьми, дуже захоплююче'
  },
  {
    id: nanoid(),
    name: 'Денис',
    review:
      'Дуже сподобалась екскурсія, відвідували разом з дітьми, дуже захоплююче'
  },
  {
    id: nanoid(),
    name: 'Олена',
    review:
      'Дуже сподобалась екскурсія, відвідували разом з дітьми, дуже захоплююче'
  },
  {
    id: nanoid(),
    name: 'Надія',
    review:
      'Дуже сподобалась екскурсія, відвідували разом з дітьми, дуже захоплююче'
  },
  {
    id: nanoid(),
    name: 'Денис',
    review:
      'Дуже сподобалась екскурсія, відвідували разом з дітьми, дуже захоплююче'
  },
  {
    id: nanoid(),
    name: 'Олена',
    review:
      'Дуже сподобалась екскурсія, відвідували разом з дітьми, дуже захоплююче'
  }
];
